

const words:Array<Array<string>> = [
    ["只有飞速的旋转，才可以止住我的泪水，忘记你的模样。", "不祥之刃"],
    ["他们都说我是穿着东方盔甲的奇怪人，但我只想顶在最前面，用我的长枪保护我的朋友。", "德邦总管"],
    ["一曲终了、繁花散尽、伊人已逝，只余一声空叹", "死亡歌颂者"],
    ["妩媚倾城的面容 我蛊惑万千众生 孰不知 心里 早有了一个人 ..却只能无尽的思念 你送我的宝珠 我一直带着 只因为我能看见你的身影。", "九尾妖狐"],
    ["我醒来了，但是我什么都不记得，我很害怕，我包裹住我的身体，然后独自在黑暗中哭泣。", "殇之木乃伊"],
    ["我还以为你从来都不会选我呢...", "殇之木乃伊"],
    ["我们这是要去哪儿？", "殇之木乃伊"],
    ["真可怜，让我抱抱你...", "殇之木乃伊"],
    ["我只是部落遗子，你确是高贵公主，我愿把我生命的力量化为三刀为你而战，只为证明我－－配的上你…", "蛮族之王"],
    ["我很想陪伴在你身边，只是你不允许，没关系，在你需要帮助时，我还是会出现在你身边。", "暮光之眼"],
    ["我一路种下了蘑菇、只为让你知道回家的路。", "迅捷斥候"],
    ["我一直急速前行 穿梭于人人之间 试图叫应接不暇的风景让我褪去对你的思念", "无极剑圣"],
    ["我蒙上自己的双眼，只想记住最后看你的那一眼。 我刺瞎自己的双眼 只为记住那逝去的红颜。", "盲僧"],
    ["纵然前路迷茫，纵然天隔一方，纵然我手中的刀刃已然破碎，也无法阻挡我寻找你的道路。", "放逐之刃"],
    ["当黑色的玫瑰悄悄绽放，除了镜花水月，又有谁能够了解我的心？", "诡术妖姬"],
    ["俺很生气，后果很严重！", "牛头酋长·阿利斯塔"],
    ["我于杀戮之中盛放，亦如黎明中的花朵", "戏命师"],
    ["有人说他们上辈子都是折翼的天使……但我上辈子是什么呢？", "堕落天使"],
    ["只不过是镜花水月", "诡术妖姬"],
    ["生命中有三件必经之事：荣誉、死亡、还有宿醉", "疾风剑豪"],
    ["风呀，带我一程吧！", "风之暴怒"],
    ["没有什么可以击退我", "牛头酋长·阿利斯塔"],
    ["你也要来玩么？很好玩的哟！", "黑暗之女"],
    ["再烦我就打你哟！", "黑暗之女"],
    ["别掉队吖！", "黑暗之女"],
    ["火焰 是我最喜欢的玩具！", "黑暗之女"],
    ["不要变成发抖的小喵喵", "黑暗之女"],
    ["化为灰烬，就是他们的宿命！", "黑暗之女"],
    ["发动机已启动，随时可以出发", "蒸汽机器人"],
    ["魔法和蒸汽指引着我", "蒸汽机器人"],
    ["王牌飞行员申请出战！", "英勇投弹手"],
    ["大部分人都会打飞机！这对飞机来说很不公平！", "英勇投弹手"],
    ["打得漂亮！", "英勇投弹手"],
    ["我现在已经飙到极限了！！", "英勇投弹手"],
    ["随时可以起飞！", "英勇投弹手"],
    ["汤姆上校呼叫地面控制", "英勇投弹手"],
    ["福无双至，祸不单行。", "寡妇制造者"],
    ["穿高跟鞋走成这样得付出巨大的努力", "寡妇制造者"],
    ["黑夜，就是我的面纱", "寡妇制造者"],
    ["是时候表演真正的技术了！", "探险家"],
    ["别把脏血溅到我光鲜的铠甲上！", "德玛西亚之力"],
    ["德玛西亚万岁！", "德玛西亚之力"],
    ["为了伟大的科学！", "大发明家"],
    ["你们的智商如此之低，还有什么还指望的呢？", "大发明家"],

]

function getRandomWord(words:Array<Array<string>>): Array<string> {  
    var Range = words.length;  
    var Rand = Math.random();  
    var index = Math.round(Rand * Range);
    // console.log(index);
    if (index > Range - 1) {
        index = Range - 1;
    }
    return words[index];  
}

export function hero_word():{ [key: string]: string; }  {
    let word = getRandomWord(words);

    return {
        "word" : word[0],
        "hero" : word[1],
    };
}